espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_syscfg.h
/* Bit fields for SYSCFG RADIOECCCTRL */
#define _SYSCFG_RADIOECCCTRL_RESETVALUE                    0x00000000UL                                       /**< Default value for SYSCFG_RADIOECCCTRL       */
#define _SYSCFG_RADIOECCCTRL_MASK                          0x00000303UL                                       /**< Mask for SYSCFG_RADIOECCCTRL                */
#define SYSCFG_RADIOECCCTRL_SEQRAMECCEWEN                  (0x1UL << 0)                                       /**< SEQRAM ECC Write Enable                     */
#define _SYSCFG_RADIOECCCTRL_SEQRAMECCEWEN_SHIFT           0                                                  /**< Shift value for SYSCFG_SEQRAMECCEWEN        */
#define _SYSCFG_RADIOECCCTRL_SEQRAMECCEWEN_MASK            0x1UL                                              /**< Bit mask for SYSCFG_SEQRAMECCEWEN           */
#define _SYSCFG_RADIOECCCTRL_SEQRAMECCEWEN_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_RADIOECCCTRL        */
#define SYSCFG_RADIOECCCTRL_SEQRAMECCEWEN_DEFAULT          (_SYSCFG_RADIOECCCTRL_SEQRAMECCEWEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for SYSCFG_RADIOECCCTRL*/
#define SYSCFG_RADIOECCCTRL_SEQRAMECCCHKEN                 (0x1UL << 1)                                       /**< SEQRAM ECC Check Enable                     */
#define _SYSCFG_RADIOECCCTRL_SEQRAMECCCHKEN_SHIFT          1                                                  /**< Shift value for SYSCFG_SEQRAMECCCHKEN       */
#define _SYSCFG_RADIOECCCTRL_SEQRAMECCCHKEN_MASK           0x2UL                                              /**< Bit mask for SYSCFG_SEQRAMECCCHKEN          */
#define _SYSCFG_RADIOECCCTRL_SEQRAMECCCHKEN_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_RADIOECCCTRL        */
#define SYSCFG_RADIOECCCTRL_SEQRAMECCCHKEN_DEFAULT         (_SYSCFG_RADIOECCCTRL_SEQRAMECCCHKEN_DEFAULT << 1) /**< Shifted mode DEFAULT for SYSCFG_RADIOECCCTRL*/
#define SYSCFG_RADIOECCCTRL_FRCRAMECCEWEN                  (0x1UL << 8)                                       /**< FRCRAM ECC Write Enable                     */
#define _SYSCFG_RADIOECCCTRL_FRCRAMECCEWEN_SHIFT           8                                                  /**< Shift value for SYSCFG_FRCRAMECCEWEN        */
#define _SYSCFG_RADIOECCCTRL_FRCRAMECCEWEN_MASK            0x100UL                                            /**< Bit mask for SYSCFG_FRCRAMECCEWEN           */
#define _SYSCFG_RADIOECCCTRL_FRCRAMECCEWEN_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_RADIOECCCTRL        */
#define SYSCFG_RADIOECCCTRL_FRCRAMECCEWEN_DEFAULT          (_SYSCFG_RADIOECCCTRL_FRCRAMECCEWEN_DEFAULT << 8)  /**< Shifted mode DEFAULT for SYSCFG_RADIOECCCTRL*/
#define SYSCFG_RADIOECCCTRL_FRCRAMECCCHKEN                 (0x1UL << 9)                                       /**< FRCRAM ECC Check Enable                     */
#define _SYSCFG_RADIOECCCTRL_FRCRAMECCCHKEN_SHIFT          9                                                  /**< Shift value for SYSCFG_FRCRAMECCCHKEN       */
#define _SYSCFG_RADIOECCCTRL_FRCRAMECCCHKEN_MASK           0x200UL                                            /**< Bit mask for SYSCFG_FRCRAMECCCHKEN          */
#define _SYSCFG_RADIOECCCTRL_FRCRAMECCCHKEN_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_RADIOECCCTRL        */
#define SYSCFG_RADIOECCCTRL_FRCRAMECCCHKEN_DEFAULT         (_SYSCFG_RADIOECCCTRL_FRCRAMECCCHKEN_DEFAULT << 9) /**< Shifted mode DEFAULT for SYSCFG_RADIOECCCTRL*/

/* Bit fields for SYSCFG RADIORAMCTRL */
#define _SYSCFG_RADIORAMCTRL_RESETVALUE                    0x00000000UL                                          /**< Default value for SYSCFG_RADIORAMCTRL       */
#define _SYSCFG_RADIORAMCTRL_MASK                          0x01070007UL                                          /**< Mask for SYSCFG_RADIORAMCTRL                */
#define SYSCFG_RADIORAMCTRL_SEQRAMCACHEEN                  (0x1UL << 0)                                          /**< SEQRAM CACHE Enable                         */
#define _SYSCFG_RADIORAMCTRL_SEQRAMCACHEEN_SHIFT           0                                                     /**< Shift value for SYSCFG_SEQRAMCACHEEN        */
#define _SYSCFG_RADIORAMCTRL_SEQRAMCACHEEN_MASK            0x1UL                                                 /**< Bit mask for SYSCFG_SEQRAMCACHEEN           */
#define _SYSCFG_RADIORAMCTRL_SEQRAMCACHEEN_DEFAULT         0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_SEQRAMCACHEEN_DEFAULT          (_SYSCFG_RADIORAMCTRL_SEQRAMCACHEEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/
#define SYSCFG_RADIORAMCTRL_SEQRAMWSEN                     (0x1UL << 1)                                          /**< SEQRAM WAIT STATE Enable                    */
#define _SYSCFG_RADIORAMCTRL_SEQRAMWSEN_SHIFT              1                                                     /**< Shift value for SYSCFG_SEQRAMWSEN           */
#define _SYSCFG_RADIORAMCTRL_SEQRAMWSEN_MASK               0x2UL                                                 /**< Bit mask for SYSCFG_SEQRAMWSEN              */
#define _SYSCFG_RADIORAMCTRL_SEQRAMWSEN_DEFAULT            0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_SEQRAMWSEN_DEFAULT             (_SYSCFG_RADIORAMCTRL_SEQRAMWSEN_DEFAULT << 1)        /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/
#define SYSCFG_RADIORAMCTRL_SEQRAMPREFETCHEN               (0x1UL << 2)                                          /**< SEQRAM Prfetch Enable                       */
#define _SYSCFG_RADIORAMCTRL_SEQRAMPREFETCHEN_SHIFT        2                                                     /**< Shift value for SYSCFG_SEQRAMPREFETCHEN     */
#define _SYSCFG_RADIORAMCTRL_SEQRAMPREFETCHEN_MASK         0x4UL                                                 /**< Bit mask for SYSCFG_SEQRAMPREFETCHEN        */
#define _SYSCFG_RADIORAMCTRL_SEQRAMPREFETCHEN_DEFAULT      0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_SEQRAMPREFETCHEN_DEFAULT       (_SYSCFG_RADIORAMCTRL_SEQRAMPREFETCHEN_DEFAULT << 2)  /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/
#define SYSCFG_RADIORAMCTRL_FRCRAMCACHEEN                  (0x1UL << 16)                                         /**< FRCRAM CACHE Enable                         */
#define _SYSCFG_RADIORAMCTRL_FRCRAMCACHEEN_SHIFT           16                                                    /**< Shift value for SYSCFG_FRCRAMCACHEEN        */
#define _SYSCFG_RADIORAMCTRL_FRCRAMCACHEEN_MASK            0x10000UL                                             /**< Bit mask for SYSCFG_FRCRAMCACHEEN           */
#define _SYSCFG_RADIORAMCTRL_FRCRAMCACHEEN_DEFAULT         0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_FRCRAMCACHEEN_DEFAULT          (_SYSCFG_RADIORAMCTRL_FRCRAMCACHEEN_DEFAULT << 16)    /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/
#define SYSCFG_RADIORAMCTRL_FRCRAMWSEN                     (0x1UL << 17)                                         /**< FRCRAM WAIT STATE Enable                    */
#define _SYSCFG_RADIORAMCTRL_FRCRAMWSEN_SHIFT              17                                                    /**< Shift value for SYSCFG_FRCRAMWSEN           */
#define _SYSCFG_RADIORAMCTRL_FRCRAMWSEN_MASK               0x20000UL                                             /**< Bit mask for SYSCFG_FRCRAMWSEN              */
#define _SYSCFG_RADIORAMCTRL_FRCRAMWSEN_DEFAULT            0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_FRCRAMWSEN_DEFAULT             (_SYSCFG_RADIORAMCTRL_FRCRAMWSEN_DEFAULT << 17)       /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/
#define SYSCFG_RADIORAMCTRL_FRCRAMPREFETCHEN               (0x1UL << 18)                                         /**< FRCRAM Prfetch Enable                       */
#define _SYSCFG_RADIORAMCTRL_FRCRAMPREFETCHEN_SHIFT        18                                                    /**< Shift value for SYSCFG_FRCRAMPREFETCHEN     */
#define _SYSCFG_RADIORAMCTRL_FRCRAMPREFETCHEN_MASK         0x40000UL                                             /**< Bit mask for SYSCFG_FRCRAMPREFETCHEN        */
#define _SYSCFG_RADIORAMCTRL_FRCRAMPREFETCHEN_DEFAULT      0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_FRCRAMPREFETCHEN_DEFAULT       (_SYSCFG_RADIORAMCTRL_FRCRAMPREFETCHEN_DEFAULT << 18) /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/
#define SYSCFG_RADIORAMCTRL_DEMODRAMCACHEEN                (0x1UL << 24)                                         /**< DEMODRAM CACHE Enable                       */
#define _SYSCFG_RADIORAMCTRL_DEMODRAMCACHEEN_SHIFT         24                                                    /**< Shift value for SYSCFG_DEMODRAMCACHEEN      */
#define _SYSCFG_RADIORAMCTRL_DEMODRAMCACHEEN_MASK          0x1000000UL                                           /**< Bit mask for SYSCFG_DEMODRAMCACHEEN         */
#define _SYSCFG_RADIORAMCTRL_DEMODRAMCACHEEN_DEFAULT       0x00000000UL                                          /**< Mode DEFAULT for SYSCFG_RADIORAMCTRL        */
#define SYSCFG_RADIORAMCTRL_DEMODRAMCACHEEN_DEFAULT        (_SYSCFG_RADIORAMCTRL_DEMODRAMCACHEEN_DEFAULT << 24)  /**< Shifted mode DEFAULT for SYSCFG_RADIORAMCTRL*/

/* Bit fields for SYSCFG SEQRAMECCADDR */
#define _SYSCFG_SEQRAMECCADDR_RESETVALUE                   0x00000000UL                                       /**< Default value for SYSCFG_SEQRAMECCADDR      */
#define _SYSCFG_SEQRAMECCADDR_MASK                         0xFFFFFFFFUL                                       /**< Mask for SYSCFG_SEQRAMECCADDR               */
#define _SYSCFG_SEQRAMECCADDR_SEQRAMECCADDR_SHIFT          0                                                  /**< Shift value for SYSCFG_SEQRAMECCADDR        */
#define _SYSCFG_SEQRAMECCADDR_SEQRAMECCADDR_MASK           0xFFFFFFFFUL                                       /**< Bit mask for SYSCFG_SEQRAMECCADDR           */
#define _SYSCFG_SEQRAMECCADDR_SEQRAMECCADDR_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_SEQRAMECCADDR       */
#define SYSCFG_SEQRAMECCADDR_SEQRAMECCADDR_DEFAULT         (_SYSCFG_SEQRAMECCADDR_SEQRAMECCADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_SEQRAMECCADDR*/

/* Bit fields for SYSCFG FRCRAMECCADDR */
#define _SYSCFG_FRCRAMECCADDR_RESETVALUE                   0x00000000UL                                       /**< Default value for SYSCFG_FRCRAMECCADDR      */
#define _SYSCFG_FRCRAMECCADDR_MASK                         0xFFFFFFFFUL                                       /**< Mask for SYSCFG_FRCRAMECCADDR               */
#define _SYSCFG_FRCRAMECCADDR_FRCRAMECCADDR_SHIFT          0                                                  /**< Shift value for SYSCFG_FRCRAMECCADDR        */
#define _SYSCFG_FRCRAMECCADDR_FRCRAMECCADDR_MASK           0xFFFFFFFFUL                                       /**< Bit mask for SYSCFG_FRCRAMECCADDR           */
#define _SYSCFG_FRCRAMECCADDR_FRCRAMECCADDR_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for SYSCFG_FRCRAMECCADDR       */
#define SYSCFG_FRCRAMECCADDR_FRCRAMECCADDR_DEFAULT         (_SYSCFG_FRCRAMECCADDR_FRCRAMECCADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_FRCRAMECCADDR*/

/** @} End of group EFR32BG21_SYSCFG_BitFields */
/** @} End of group EFR32BG21_SYSCFG */
/** @} End of group Parts */

#endif /* EFR32BG21_SYSCFG_H */
